.config/emacs/init.el
(setq custom-file "~/.config/emacs/custom.el")
(load custom-file)

(require `package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org"   . "https://orgmode.org/elpa/")
			 ("elpa"  . "https://elpa.gnu.org/packages")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(when (daemonp)
  (exec-path-from-shell-initialize))

(recentf-mode 1)
(setq recentf-max-menu-items 10
      recentf-max-saved-items 10)

(setq backup-directory-alist `(("~/.saves"))
      backup-by-copying t)

(setq auto-save-file-name-transforms `((".*" "~/.saves/" t)))

(setq inhibit-startup-message t
      initial-scratch-message "")

(global-hl-line-mode)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
(set-fringe-mode 0)
(setq scroll-conservatively most-positive-fixnum)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(setq global-fixed-pitch-font "Inconsolata Nerd Font Mono")
(setq global-variable-pitch-font "Liberation Sans")

(when (member global-fixed-pitch-font (font-family-list))
  (set-face-attribute 'default nil :font global-fixed-pitch-font :width 'normal :height 100)
  (set-face-attribute 'fixed-pitch nil :family "Droid Sans Mono"))

(when (member global-variable-pitch-font (font-family-list))
  (set-face-attribute 'variable-pitch nil :family global-variable-pitch-font :height 0.9))

(load-theme 'gruvbox-dark-medium t)

(defun reload-config ()
  (interactive)
  (load "~/.config/emacs/init.el"))

(defvar-keymap file-io-map
  :doc "Keybind map for basic file IO tasks"
  "r" #'recentf-open-files
  "f" #'find-file
  "d" #'dired)

(defvar-keymap buffer-menu-map
  :doc "Keybind map for buffer tasks"
  "s" #'scratch-buffer
  "m" #'buffer-menu
  "K" #'kill-buffer)

(defvar-keymap org-download-map
  :doc "Keybind for org-download tools")

(defvar-keymap org-io-map
  :doc "Keybind map for org stuff"
  "a" 'org-agenda
  "p" 'org-latex-preview
  "d" `("Org-download options" . ,org-download-map))

(defvar-keymap global-prefix-map
  :doc "Global custom prefix map"
  "o" `("Org IO Keybinds" . ,org-io-map)
  "f" `("File IO Keybinds" . ,file-io-map)
  "b" `("Buffer & Options" . ,buffer-menu-map)
  "r" 'reload-config)

(keymap-set global-map "C-SPC" global-prefix-map)

(use-package neotree
  :bind (:map global-prefix-map
	      ("t" . 'neotree-toggle))
  :config
  (setq neo-theme (if (display-graphic-p) 'nerd 'arrow)))

(use-package mood-line
  :config
  (mood-line-mode)

  :custom
  (mood-line-glyph-alist mood-line-glyphs-ascii)
  (setq mood-line-format mood-line-format-default-extended))

(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))

(use-package evil
  :init
  (setq evil-want-keybinding nil)
  (setq evil-undo-system 'undo-fu)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (ivy-prescient-mode 1))

(use-package counsel
  :config
  (counsel-mode 1))

(use-package company
  :config
  (setq company-idle-delay 0)
  (setq company-tooltip-align-annotations t)
  (setq company-tooltip-limit 8)
  (setq company-dabbrev-minimum-length 4)
  (setq company-dabbrev-other-buffers t)
  
  (setq company-backends '((company-capf company-dabbrev company-ispell)))
  (setq company-transformers '(company-sort-by-occurrence company-sort-by-backend-importance))
  (global-company-mode))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0)) ;; delay before showing key guide

(use-package elfeed
  :config
  (setq elfeed-search-title-max-width 120)
  (setq elfeed-feeds
	'(("https://ludic.mataroa.blog/rss/" blog) 
	  ("https://racer.com/indycar/feed/" racing)))

  (defface important-elfeed-entry
    '((t :forefround "#f77"))
    "Import Elfeed entries.")
  (push '(important important-elfeed-entry)
	elfeed-search-face-alist)

  (add-hook 'elfeed-new-entry-hook
	    (elfeed-make-tagger :before "1 month ago" :remove 'unread)))

(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")
  ;;(setq lsp-signature-render-documentation nil)
  :hook (
	 ;;; (XXX-mode. lsp)
	 (python-mode . lsp)
	 ;; (sh-mode . lsp) ; Requires shellcheck, shfmt ;; Something wrong, freezes client
	 (rust-mode . lsp)
	 (c-mode . lsp)
	 (c++-mode . lsp)
	 (lsp-mode . lsp-enable-which-key-integration)
	 (lsp-mode . lsp-ui-mode))
  :commands lsp
  :config
  ;;(setq lsp-clangd-
  ;;(setq lsp-clients-clangd-args "-std=c++20")
  (setq lsp-pylsp-plugins-jedi-completion-enabled t)
  (setq lsp-pylsp-plugins-jedi-completion-fuzzy t)
  (setq lsp-pylsp-plugins-jedi-environment "/usr/bin/python3")
  (setq lsp-eldoc-render-all nil)
  (setq lsp-inlay-hint-enable nil)
  (setq lsp-eldoc-enable-hover t)
  (setq lsp-signature-doc-lines 5)
  (setq lsp-signature-render-documentation nil)
  (setq lsp-signature-auto-activate nil))
