org/roam/20250206102707-config.org
** ~lsp-ui~
#+begin_src elisp
(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :config
  (lsp-ui-peek-enable t)
  (setq lsp-ui-doc-enable t)
  (setq lsp-ui-doc-show-with-cursor t)
  (setq lsp-ui-doc-side 'left)
  (setq lsp-ui-doc-delay 1)
  (setq lsp-ui-doc-position 'at-point))
#+end_src
** ~lsp-ivy~
#+begin_src elisp
(use-package lsp-ivy
  :commands lsp-ivy-workspace-symbol)
#+end_src
** Language specific
#+begin_src elisp
  (use-package docker-compose-mode)
  (use-package dockerfile-mode)
  (use-package mermaid-mode)
  (use-package spice-mode)
  (use-package python-mode)
  (use-package rust-mode)
  (use-package flycheck-rust)
  (use-package json-mode)
  (use-package flycheck)
#+end_src
*** Rustic
#+begin_src elisp
  (use-package rustic
    :ensure
    :config
    (setq rustic-format-on-save t))
#+end_src
* Org
** Base behavior
*** Hooks
#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook 'visual-line-mode)
#+end_src
** Roam
*** General
#+begin_src elisp
(use-package org-roam
  :bind (:map org-io-map
	      ("c" . 'org-roam-capture)
	      ("f" . 'org-roam-node-find))
  :config
  (setq org-roam-completion-everywhere t
	org-roam-directory (file-truename "~/org/roam")))
#+end_src
*** Capture
#+begin_src elisp
  (add-hook 'org-capture-after-finalize-hook 'my-org-exit-frame-if-fleeting)

  (setq org-roam-capture-templates
        '(
          ("d" "default node" plain "%?"
           :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                            "#+title: ${title}\n#+filetags: ${filetags}")
           :unnarrowed t)
          ("l" "lecture notes" plain
          "* Lecture Notes\n- %?"
          :target (file+head "lecture-notes/${title}.org"
                      "#+filetags: lecture-%^{prompt||iss308|ece366|mth425|cse331|ece309} \n#+title: ${title}\n")
          :unnarrowed t)
          ("t" "todo" entry
           "* TODO %?"
           :target (node "todos")
           :kill-buffer t)
          ))

#+end_src
*** TODOs
#+begin_src elisp
(setq org-log-done 'time)
(setq org-agenda-skip-deadline-if-done t)

(setq org-todo-keywords
      '((sequence
	 "IDEA(i)"
	 "TODO(t)"
	 "INACTIVE(I)"
	 "DOING(d)"
	 "BLOCKED(b@)"
	 "|"
	 "COMPLETE(c!)"
	 "NOT DOING(n!)")))
#+end_src
*** Packages
**** ~org-roam-ql~
#+begin_src elisp
(use-package org-roam-ql
  :after (org-roam)
  :bind ((:map org-roam-mode-map
	       ("v" . org-roam-ql-buffer-dispatch)
	       :map minibuffer-mode-map
	       ("C-c n i" . org-roam-ql-insert-node-title))))
#+end_src
*** Custom helper methods
**** Tag retrieval
#+begin_src elisp
(defun my-org-get-tags-at-point-safe ()
  (interactive)
  (or (split-string (or (org-entry-get (point) "TAGS") "nil") ":" t) "nil"))

(defun my-org-get-tags-list (point)
  (split-string (or (org-entry-get (point) "TAGS") "nil") ":" t))
#+end_src
*** Automatic categorization
**** Tag - category associations
#+begin_src elisp
(setq my-org-categories-alist
      '(("reading" . "READING")))
#+end_src
**** Categorization
#+begin_src elisp
(defun my-org-categorize-by-tags ()
  (interactive)
  (org-map-entries (lambda ()
		     (let*
			 ((tags nil)
			  (targetcat nil))
		       (when-let
			   ;; (tags (split-string (or (org-entry-get (point) "TAGS") "nil") ":" t))
			   (tags (my-org-get-tags-at-point-safe))
			 (dolist (targetcat my-org-categories-alist)
			   (when (member (car targetcat) tags)
			     (org-entry-put (point) "CATEGORY" (cdr targetcat)))))))))
#+end_src
*** Automatic refiling
**** Tag - file associations
#+begin_src elisp
(setq my-org-refile-by-tag-alist
      '(("cse331" . "~/org/roam/cse331.org")))
#+end_src
** Agenda
*** Packages
**** ~org-super-agenda~
#+begin_src elisp
(use-package org-super-agenda
  :hook (org-agenda-mode . org-super-agenda-mode)
  :config
  (setq org-super-agenda-groups
	'((:log t)
	    (:name "Today"
		:scheduled today))))
#+end_src
*** Files
#+begin_src elisp
(setq org-agenda-files '("~/org/roam" "~/org/roam/daily"))
#+end_src
*** Prefix format
#+begin_src elisp
(setq org-agenda-prefix-format
      '((agenda . "%+12(my-org-category-prefix) [ %15(string-join (my-org-get-tags-at-point-safe) \":\") ] %5t %s")
	(todo . " %i %-12:c")
	(tags . " %i %-12:c")
	(search . "%i %-12:c")))
#+end_src
*** Appearance
#+begin_src elisp
(set-face-foreground 'org-upcoming-deadline "goldenrod1")
(set-face-foreground 'org-imminent-deadline "tomato1")

(setq org-agenda-deadline-faces
      '((1.0 . org-imminent-deadline)
	(0.5 . org-upcoming-deadline)
	(0.0 . org-upcoming-distant-deadline)))

(setq org-agenda-window-setup "only-window")

(setq org-agenda-span 'week)

(setq org-agenda-skip-deadline-if-done nil)
(setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))

#+end_src
*** Deadline warning
#+begin_src elisp
(setq org-deadline-warning-days 7)
#+end_src
*** Category prefix function
#+begin_src elisp
(defun my-org-category-prefix ()
  (interactive)
  (let*
      ((category (org-entry-get (point) "CATEGORY"))
       (fname (file-name-sans-extension (file-name-nondirectory (or (buffer-file-name) "nil")))))
    (if (string-equal category fname)
      "MISC"
      category)))
#+end_src

** Babel
*** General
#+begin_src elisp
(setq org-src-window-setup 'split-window-below
      org-babel-python-command "python3"
      org-confirm-babel-evaluate nil) ;; Don't ask to execute
#+end_src
*** Packages
**** ~ob-mermaid~
#+begin_src elisp
(use-package ob-mermaid)
#+end_src
*** Languages
#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((mermaid . t)
   (python . t)
   (emacs-lisp . t)))
#+end_src
** General appearance
*** Lists
Use a dot in place of a dash for items
#+begin_src elisp
(font-lock-add-keywords 'org-mode
			'(("^ *\\([-]\\) "
			   (0 (prog1 ()
				(compose-region
				 (match-beginning 1)
				 (match-end 1)
				 "•" ))))))
#+end_src
*** Indentation
Indent contextually to outline node level, set indentation width per-indent to 4 spaces, replace ellipsis for folded headings with " ... "
#+begin_src elisp
(setq org-adapt-indentation t
      org-indent-indentation-per-level 4
      org-ellipsis " ... ")
#+end_src
*** Headings
#+begin_src elisp
Hide leading stars for headings, use UTF-8 symbols
(setq org-hide-leading-stars t
      org-pretty-entities t)
#+end_src
*** Source blocks
#+begin_src elisp
(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)
#+end_src
*** TODOs
#+begin_src elisp
(setq org-todo-keyword-faces
      '(
	("IDEA" . (:foreground "dark khaki" :weight bold))
	("INACTIVE" . (:foreground "dim gray" :weight bold))
	("TODO" . (:foreground "cyan" :weight bold))
	("DOING" . (:foreground "tan" :weight bold))
	("BLOCKED" . (:foreground "tomato" :weight bold))
	("COMPLETE" . (:foreground "chartreuse" :weight bold))
	("NOT DOING" . (:foreground "dim gray" :weight bold))
	))
#+end_src
*** Packages
**** ~org-bullets~
#+begin_src elisp
(use-package org-bullets
  :hook (org-mode . org-bullets-mode))
;(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src
**** ~org-appear~
#+begin_src elisp
(setq org-hide-emphasis-markers t)

(use-package org-appear
  :commands (org-appear-mode)
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-hide-emphasis-markers t)
  (setq org-appear-autoemphasis t
	org-appear-autolinks t
	org-appear-autosubmarkers t))
#+end_src
**** ~org-special-blocks-extra~
#+begin_src elisp
(use-package org-special-block-extras
  :ensure t
  :hook (org-mode . org-special-block-extras-mode))
#+end_src
**** ~olivetti~
#+begin_src elisp
(use-package olivetti
  :hook (org-mode . olivetti-mode)
  :config
  (setq olivetti-body-width 0.70))
#+end_src
*** Faces (re-sort later)
#+begin_src elisp
(with-eval-after-load 'org-faces
  (progn
    (set-face-attribute 'org-block nil :inherit 'fixed-pitch :height 0.85)
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-hide nil :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-block-begin-line nil :inherit '(org-hide))
    (set-face-attribute 'org-block-begin-line nil :extend t)
    ;; (set-face-attribute 'org-block nil :background "#282828"))
    (set-face-attribute 'org-block-end-line nil :extend t))
    (require 'org-indent)
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch) :height 0.85))

(add-hook 'org-mode-hook 'variable-pitch-mode)
#+end_src
** Export
*** Packages
**** ~ox-md~
#+begin_src elisp
(require 'ox-md)
#+end_src
** LaTeX
*** Packages
**** ~org-fragtog~
#+begin_src elisp
(use-package org-fragtog
  :hook (org-mode . org-fragtog-mode))
#+end_src
